#+TITLE:     Greg Tucker-Kellogg's Emacs configuration
#+PROPERTY


** Org capture behavior

#+begin_src emacs-lisp :tangle yes

  (use-package org-journal
    :ensure t
    :defer nil
    :custom
    (org-journal-dir (expand-file-name (concat org-directory "journal")))
    (org-journal-date-format "%A, %d %B %Y")
    :init
    (setq org-journal-file-type 'monthly)
    :bind (("C-c M-j" . org-journal-new-entry)))


    (defun org-journal-find-location ()
      ;; Open today's journal, but specify a non-nil prefix argument in order to
      ;; inhibit inserting the heading; org-capture will insert the heading.
      (org-journal-new-entry t)
      ;; Position point on the journal's top-level heading so that org-capture
      ;; will add the new entry as a child entry.
      (goto-char (point-min)))

      (setq org-capture-templates
            `(
              ("t" "Todo items" entry (file+headline my/organizer "Tasks")
               "* TODO %?\n  %i")
              ("T" "Todo items (with link)" entry (file+headline my/organizer "Tasks")
               "* TODO %?\n  %i\n  %a")
              ("i" "Into the inbox" entry (file+datetree my/inbox)
               "* %?\n\nEntered on %U\n  %i" )
              ("j" "Journal entry" entry (function org-journal-find-location)
               "* %(format-time-string org-journal-time-format)%^{Title}\n%i%?")
              ("R" "Weekly review"  entry (file+headline my/organizer  "Weekly Review")
               (file ,(expand-file-name (concat org-directory "templates/weekly-review.org")))
               )
              ;; ("j" "Journal entries" entry (file+datetree my/journal)
              ;;  "* %?\n\nEntered on %U\n  %i\n  %a" )
              ;; ("J" "Journal entries from nowhere" entry (file+datetree my/journal)
              ;;  "* %?\n\nEntered on %U\n  %i\n" )
               ))
#+end_src 

#+RESULTS:
| t | Todo items | entry | (file+headline my/organizer Tasks) | * TODO %? |
 
 
